I am also experiencing a very similar problem. 

This works
```
aws --endpoint-url=http://localhost:4566 s3 mb s3://mwaa1
make_bucket: mwaa1
```

I have tried to create the bucket with terraform

```
provider "aws" {
  access_key                  = "dummyaccess"
  region                      = "us-east-1"
  secret_key                  = "dummysecret"
  skip_credentials_validation = true
  skip_metadata_api_check     = true
  skip_requesting_account_id  = true

  endpoints {
    dynamodb = "http://localhost:4566"
    lambda   = "http://localhost:4566"
    kinesis  = "http://localhost:4566"
    kms      = "http://localhost:4566"
    s3       = "http://localhost:4566"
  }
}

resource "aws_s3_bucket" "this" {
  bucket = "mwaa1"
}
```
Here is the Terraform Plan

```
Terraform will perform the following actions:

  # module.dfir_infra.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mwaa1"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

I get an error about Reg and the Bucket Name. but you can see `mwaa1` is allowed.

```
localstack      |   File "/opt/code/localstack/.venv/lib/python3.8/site-packages/botocore/handlers.py", line 253, in validate_bucket_name
localstack      |     raise ParamValidationError(report=error_msg)
localstack      | botocore.exceptions.ParamValidationError: Parameter validation failed:
localstack      | Invalid bucket name "?acl=": Bucket name must match the regex "^[a-zA-Z0-9.\-_]{1,255}$" or be an ARN matching the regex "^arn:(aws).*:(s3|s3-object-lambda):[a-z\-0-9]*:[0-9]{12}:accesspoint[/:][a-zA-Z0-9\-.]{1,63}$|^arn:(aws).*:s3-outposts:[a-z\-0-9]+:[0-9]{12}:outpost[/:][a-zA-Z0-9\-]{1,63}[/:]accesspoint[/:][a-zA-Z0-9\-]{1,63}$"
```